In [1]:
# Import necessary packages
import pandas as pd
import numpy as np

In [2]:
# Get airbnb price data
airbnb_price_df = pd.read_csv('../data/airbnb_price.csv')
airbnb_price_df.head()

   listing_id        price                nbhood_full
0        2595  225 dollars         Manhattan, Midtown
1        3831   89 dollars     Brooklyn, Clinton Hill
2        5099  200 dollars     Manhattan, Murray Hill
3        5178   79 dollars  Manhattan, Hell's Kitchen
4        5238  150 dollars       Manhattan, Chinatown

In [3]:
# Get airbnb room type data
data = pd.ExcelFile('../data/airbnb_room_type.xlsx')
airbnb_room_type_df = data.parse(0)
airbnb_room_type_df.head()

   listing_id                                description        room_type
0        2595                      Skylit Midtown Castle  Entire home/apt
1        3831            Cozy Entire Floor of Brownstone  Entire home/apt
2        5099  Large Cozy 1 BR Apartment In Midtown East  Entire home/apt
3        5178            Large Furnished Room Near B'way     private room
4        5238         Cute & Cozy Lower East Side 1 bdrm  Entire home/apt

In [4]:
# Get airbnb review data
airbnb_last_review_df = pd.read_csv('../data/airbnb_last_review.tsv', sep='\t')
airbnb_last_review_df.head()

   listing_id    host_name   last_review
0        2595     Jennifer   May 21 2019
1        3831  LisaRoxanne  July 05 2019
2        5099        Chris  June 22 2019
3        5178     Shunichi  June 24 2019
4        5238          Ben  June 09 2019

In [5]:
# Join three dataframes together
listings = pd.merge(airbnb_price_df, airbnb_room_type_df, on = 'listing_id')
listings = pd.merge(listings, airbnb_last_review_df, on = 'listing_id')
listings.head()

,listing_id,price,nbhood_full,description,room_type,host_name,last_review
0,2595,225 dollars,"Manhattan, Midtown",Skylit Midtown Castle,Entire home/apt,Jennifer,May 21 2019
1,3831,89 dollars,"Brooklyn, Clinton Hill",Cozy Entire Floor of Brownstone,Entire home/apt,LisaRoxanne,July 05 2019
2,5099,200 dollars,"Manhattan, Murray Hill",Large Cozy 1 BR Apartment In Midtown East,Entire home/apt,Chris,June 22 2019
3,5178,79 dollars,"Manhattan, Hell's Kitchen",Large Furnished Room Near B'way,private room,Shunichi,June 24 2019
4,5238,150 dollars,"Manhattan, Chinatown",Cute & Cozy Lower East Side 1 bdrm,Entire home/apt,Ben,June 09 2019

In [6]:
# What are the dates of the earliest and most recent reviews?
listings['last_review_date'] = pd.to_datetime(listings['last_review'], format='%B %d %Y')
first_reviewed = listings['last_review_date'].min()
last_reviewed = listings['last_review_date'].max()

In [7]:
# How many of the listings are private rooms? 
listings['room_type'] = listings['room_type'].str.lower() # Because there are some lower and upper case problems
nb_private_rooms = listings[listings['room_type'] == 'private room'].shape[0]
print(nb_private_rooms)

11356

In [8]:
# What is the average listing price? Round to the nearest two decimal places and save into a variable.
listings['price'] = listings['price'].str.replace(' dollars','').astype(float)
avg_price = listings['price'].mean()
print(avg_price)

141.7779364512674

In [9]:
# Combine the new variables into one DataFrame called review_dates with four columns in the following order: first_reviewed, last_reviewed, nb_private_rooms, and avg_price. The DataFrame should only contain one row of values.
review_dates = pd.DataFrame({
    'first_reviewed': [first_reviewed],
    'last_reviewed': [last_reviewed],
    'nb_private_rooms': [nb_private_rooms],
    'avg_price': [round(avg_price, 2)]
})

print(review_dates)

  first_reviewed last_reviewed  nb_private_rooms  avg_price
0     2019-01-01    2019-07-09             11356     141.78